views = ["作为一个人，他的精力是有限的，他的行为会消耗他的精力，当一个人的精力不足时，他必须有所取舍。",
"对于社交，他所能提供的精力是有限的，而一段优秀的社交是让你感到舒服的，你可以不表演，不需要一直输出有意思的内容。",
"在好的社交里，双方都在表达，都在倾听。不是永远一个人倾诉，一个人接住",
"我对于自己行为的把握基于我对于自己的认知，我对于自己的认知越深入，我越能把握我行为背后的原因。"
"这段时间我没有参与你们的讨论，但是你们发的消息我都看了，我知道你们有各自的小烦恼也有各自的成长。我知道说自己忙是个不成熟、没有信服力的理由，"
]
i = 0
print("作为一个信院的学生，让我们用一种不一样的方法来交流吧！")
while i < len(views):
    print(views[i])
    answer = input("请输入你的观点是(是或不是)：")
    if answer == "是":
        i +=1
        print("好的，让我们进行下一步")
    else:
        print("OK，我知道我们的分歧点在哪里了，让我们来就这个问题进行深入交流吧！")
        break
else:
    print("太好了，我们达成了共识！")